NAME := cube3D

SRC_DIR := src/
VEC2_DIR := vec2/
PARSING_DIR	:= parsing/
TEXTURE_DIR := textures/
GAME_DIR	:= game/
EVENT_DIR	:= event/

BUILD_DIR := build/

SRCS := main.c \
		$(EVENT_DIR)event.c \
		$(GAME_DIR)free_game.c \
		$(GAME_DIR)init.c \
		$(GAME_DIR)render.c \
		$(PARSING_DIR)check_map.c \
		$(PARSING_DIR)checker.c \
		$(PARSING_DIR)parsing.c \
		$(PARSING_DIR)parsing_free.c \
		$(PARSING_DIR)parsing_getter.c \
		$(PARSING_DIR)parsing_reader.c \
		$(TEXTURE_DIR)init_textures.c \
		$(TEXTURE_DIR)texture.c \
		$(VEC2_DIR)dvec2_utils1.c \
		$(VEC2_DIR)vec2_utils1.c \
		$(VEC2_DIR)vec2_utils2.c \
		$(VEC2_DIR)vec_convert.c \

OBJ := $(patsubst %.c, $(BUILD_DIR)%.o, $(SRCS))

HEADERS := includes/
HEADERS_BONUS := includes_bonus/

LIBS := lib/libft/libft.a \
		lib/MacroLibX/libmlx.so

CC := cc

FLAGS := -g -Wall -Werror -Wextra

all: ${NAME} header

header:
	@echo "  ██████╗██╗   ██╗██████╗ ███████╗██████╗ ██████╗                                                                      "
	@echo " ██╔════╝██║   ██║██╔══██╗██╔════╝╚════██╗██╔══██╗                                                                     "
	@echo " ██║     ██║   ██║██████╔╝█████╗   █████╔╝██║  ██║                                                                     "
	@echo " ██║     ██║   ██║██╔══██╗██╔══╝   ╚═══██╗██║  ██║                                                                     "
	@echo " ╚██████╗╚██████╔╝██████╔╝███████╗██████╔╝██████╔╝                                                                     "
	@echo "  ╚═════╝ ╚═════╝ ╚═════╝ ╚══════╝╚═════╝ ╚═════╝                                                                      "
	@echo "\n"
	@echo "          ███╗   ███╗ ██████╗ ██╗   ██╗███████╗    ██╗    ██╗██╗████████╗██╗  ██╗    ██╗    ██╗ █████╗ ███████╗██████╗ "
	@echo "          ████╗ ████║██╔═══██╗██║   ██║██╔════╝    ██║    ██║██║╚══██╔══╝██║  ██║    ██║    ██║██╔══██╗██╔════╝██╔══██╗"
	@echo "█████╗    ██╔████╔██║██║   ██║██║   ██║█████╗      ██║ █╗ ██║██║   ██║   ███████║    ██║ █╗ ██║███████║███████╗██║  ██║"
	@echo "╚════╝    ██║╚██╔╝██║██║   ██║╚██╗ ██╔╝██╔══╝      ██║███╗██║██║   ██║   ██╔══██║    ██║███╗██║██╔══██║╚════██║██║  ██║"
	@echo "          ██║ ╚═╝ ██║╚██████╔╝ ╚████╔╝ ███████╗    ╚███╔███╔╝██║   ██║   ██║  ██║    ╚███╔███╔╝██║  ██║███████║██████╔╝"
	@echo "          ╚═╝     ╚═╝ ╚═════╝   ╚═══╝  ╚══════╝     ╚══╝╚══╝ ╚═╝   ╚═╝   ╚═╝  ╚═╝     ╚══╝╚══╝ ╚═╝  ╚═╝╚══════╝╚═════╝ "
	@echo "\n"
	@echo "          ███████╗██╗  ██╗██╗████████╗    ██╗    ██╗██╗████████╗██╗  ██╗    ███████╗███████╗ ██████╗                   "
	@echo "          ██╔════╝╚██╗██╔╝██║╚══██╔══╝    ██║    ██║██║╚══██╔══╝██║  ██║    ██╔════╝██╔════╝██╔════╝                   "
	@echo "█████╗    █████╗   ╚███╔╝ ██║   ██║       ██║ █╗ ██║██║   ██║   ███████║    █████╗  ███████╗██║                        "
	@echo "╚════╝    ██╔══╝   ██╔██╗ ██║   ██║       ██║███╗██║██║   ██║   ██╔══██║    ██╔══╝  ╚════██║██║                        "
	@echo "          ███████╗██╔╝ ██╗██║   ██║       ╚███╔███╔╝██║   ██║   ██║  ██║    ███████╗███████║╚██████╗                   "
	@echo "          ╚══════╝╚═╝  ╚═╝╚═╝   ╚═╝        ╚══╝╚══╝ ╚═╝   ╚═╝   ╚═╝  ╚═╝    ╚══════╝╚══════╝ ╚═════╝                   "
	@echo "\n\n\n"                                                                                                             
	@echo "███╗   ███╗ █████╗ ██████╗ ███████╗    ██████╗ ██╗   ██╗    ███╗   ██╗████████╗ ██████╗ ███╗   ███╗███████╗            "
	@echo "████╗ ████║██╔══██╗██╔══██╗██╔════╝    ██╔══██╗╚██╗ ██╔╝    ████╗  ██║╚══██╔══╝██╔═══██╗████╗ ████║██╔════╝            "
	@echo "██╔████╔██║███████║██║  ██║█████╗      ██████╔╝ ╚████╔╝     ██╔██╗ ██║   ██║   ██║   ██║██╔████╔██║█████╗              "
	@echo "██║╚██╔╝██║██╔══██║██║  ██║██╔══╝      ██╔══██╗  ╚██╔╝      ██║╚██╗██║   ██║   ██║   ██║██║╚██╔╝██║██╔══╝              "
	@echo "██║ ╚═╝ ██║██║  ██║██████╔╝███████╗    ██████╔╝   ██║       ██║ ╚████║   ██║   ╚██████╔╝██║ ╚═╝ ██║███████╗            "
	@echo "╚═╝     ╚═╝╚═╝  ╚═╝╚═════╝ ╚══════╝    ╚═════╝    ╚═╝       ╚═╝  ╚═══╝   ╚═╝    ╚═════╝ ╚═╝     ╚═╝╚══════╝            "

${LIBS}:
	@make --no-print-directory -C lib/MacroLibX -j16
	@make --no-print-directory -C lib/libft
	@echo "✅ Libft Compiled !"

$(NAME): ${LIBS} ${OBJ}
	@echo "✅ Cube3D Compiled !"
	@${CC} -o ${NAME} -I ${HEADERS} ${OBJ} ${LIBS} ${FLAGS} -no-pie -lm -lSDL2

${BUILD_DIR}%.o: ${SRC_DIR}%.c
	@mkdir -p $(dir $@)
	@${CC} -o $@ -I ${HEADERS} -c $< ${FLAGS}

${BUILD_DIR_BONUS}%.o: ${SRC_BONUS_DIR}%.c
	@mkdir -p $(dir $@)
	@${CC} -o $@ -I ${HEADERS_BONUS} -c $< ${FLAGS}

bonus: ${LIBS} ${OBJ_BONUS}
	@echo "✅ Cube3D bonus compiled !"
	@${CC} -o ${NAME_BONUS} -I ${HEADERS_BONUS} ${OBJ_BONUS} ${LIBS} ${FLAGS} -lm -lSDL2

clean:
	@make --no-print-directory -C lib/MacroLibX clean
	@echo "🧹 Macro deleted !"
	@rm -f ${OBJ}
	@echo "🧹 Objects deleted !"
	@rm -f ${OBJ_BONUS}
	@echo "🧹 Objects bonus deleted !"
	@make --no-print-directory -C lib/libft clean
	@echo "🧹 Libft deleted !"

fclean: clean
	@rm -f ${LIBS}
	@rm -f ${NAME}
	@rm -f ${NAME_BONUS}

re: fclean all

.PHONY: clean fclean re all
